[
    {
      "shortName": "Alimony/Spousal Support",
      "title": "Alimony and Spousal Support",
      "link": "/practice-areas/alimony-spousal-support/",
      "image": "/assets/images/practice-areas/alimony.jpg",
      "description": "Expertise in spousal support",
      "icon": "icofont-handshake-deal",
      "text": "<p>Each type of alimony serves a different purpose. It is important to understand that many factors influence whether alimony will be awarded by the Court. A spouse has a right to receive support from the other so long as the receiving spouse has the need and the other spouse has the financial ability to contribute.</p><p>An award of alimony in Florida, if any, is decided by the Court considering Section 61.08 of the Florida Statutes. The court also considers case law from the Florida Supreme Court and Florida District Courts of Appeal in deciding entitlement to alimony in Florida. Please feel free to contact me to discuss your questions about alimony in Florida. (Alimony is also referred to as “spousal support”.)</p>"
    },
    {
      "shortName": "Bankruptcy",
      "title": "Bankruptcy",
      "link": "/practice-areas/bankruptcy/",
      "image": "/assets/images/practice-areas/bankruptcy.jpg",
      "description": "Helping you through hard times",
      "icon": "icofont-coins",
      "text": "<p>Consumer Bankruptcy can be a difficult process to navigate alone. A personal bankruptcy can help qualified individuals receive a fresh start and rid themselves of unwanted debt. An experienced Florida Bankruptcy Lawyer can help guide you through the process. Our mission is to provide outstanding services, help our clients discharge their unwanted and unaffordable debts, and obtain the fresh start they deserve.</p>"
    },
    {
      "shortName": "Child Support/Custody",
      "title": "Child Support and Custody",
      "link": "/practice-areas/child-support-and-custody/",
      "image": "/assets/images/practice-areas/childsupport.jpg",
      "description": "Creative solutions to complex situations",
      "icon": "icofont-children-care",
      "text": "<p>Parents have an obligation to support their children according to their means. A parent’s child support obligation arises primarily in the context of dissolution of marriage and paternity actions. Child support is based on the combined net income of the parties, and is based on the Florida Child Support Guidelines. </p> <p> The term “custody” has been abolished by Florida law. However, an extended family member may still obtain temporary custody of a minor child if the child’s parents consent or the best interests of the child so requires. In the context of dissolution of marriage and paternity cases, custody has been replaced by the concepts of parental time-sharing and parental responsibility. As part of his or her right to exercise parental responsibility, a parent is entitled to participate in the major decisions that affect the welfare of the child(ren), such as decisions regarding choice of education, health care, religion, etc. These issues must be agreed upon by the parties prior to the final hearing, or will be determined by a judge at trial in a contested case to establish paternity or dissolve a marriage. </p>"
    },
    {
      "shortName": "Divorce",
      "title": "Divorce",
      "link": "/practice-areas/divorce/",
      "image": "/assets/images/practice-areas/divorce.jpg",
      "description": "We're here for you",
      "icon": "icofont-ui-love-broken",
      "text": "<p>Florida is a no-fault state. What this means to you is that it is not required that you prove that you are seeking a divorce due to the fault of the other party. It is only required that you state that your marriage is completely broken. Divorce cases usually require the resolution of issues such as equitable distribution of property, time sharing, custody and parenting issues, child support, alimony and entitlement to attorney’s fees and costs. If the parties are unable to agree on every single issue prior to the date of filing of the petition for dissolution of marriage, the divorce will be contested. At the Law Office of Tonya Holman, P.A., we analyze our client’s goals and work with our clients to help them make the right decisions. </p>"
    },
    {
      "shortName": "Domestic Partnerships",
      "title": "Domestic Partnerships",
      "link": "/practice-areas/domestic-partnerships/",
      "image": "/assets/images/practice-areas/domesticpartnership.jpg",
      "description": "Representing your union",
      "icon": "icofont-ui-love",
      "text": "<p>A landmark U.S. Supreme Court ruling in 2013 upheld a fundamental right to marry and triggered the federal government to grant rights and benefits to gay and lesbian partners. And in 2015, the Supreme Court ruled that same-sex couples throughout the United States must be afforded the same constitutional right to marry that traditional couples have always enjoyed. As a result same sex couples in Florida are now legally permitted to marry, and gay marriages from other states or countries are now recognized in Florida. </p>"
    },
    {
      "shortName": "Equitable Distribution",
      "title": "Equitable Distribution",
      "link": "/practice-areas/equitable-distribution/",
      "image": "/assets/images/practice-areas/equitable.jpg",
      "description": "Helping to divide your assets",
      "icon": "icofont-bank-alt",
      "text": "<p>Equitable Distribution is the legal term for dividing marital assets and debts. When married couples separate, often the most difficult questions include determining who should pay the mortgage, who gets the house, or who should pay the credit cards. There is a presumption, albeit rebuttable, that all marital assets and debts should be divided equally between husband and wife. However, there are certain statutory factors which may or may not affect your distribution. Based on your circumstances and how those distributional factors weigh in your favor, you may be entitled to receive more or less than half of your marital estate. </p>"
    },
    {
      "shortName": "Injunctions",
      "title": "Injunctions",
      "link": "/practice-areas/injunctions/",
      "image": "/assets/images/practice-areas/injunctions.jpg",
      "description": "Security for your piece of mind",
      "icon": "icofont-law-order",
      "text": "<p>The state of Florida has laws regarding obtaining and enforcing injunctions. An injunction is a court order in which a person is restrained from performing certain acts as detailed in the injunction. Those wishing to obtain an injunction must file an action with the court. Granting the injunction is up to the discretion of the court. </p>"
    },
    {
      "shortName": "Military Divorce",
      "title": "Military Divorce",
      "link": "/practice-areas/military-divorce/",
      "image": "/assets/images/practice-areas/militarydivorce.jpg",
      "description": "Dedicated to you",
      "icon": "icofont-military",
      "text": "<p>Unfortunately, the stresses of a military marriage far outweigh a civilian marriage, and in many cases the pressures and circumstances lead to a divorce. When this is the only option left, it is important that you have legal representation that understands the rules regarding military divorce. Many of the same issues exist in a civilian divorce, such as child custody and visitation, division of assets and debts, and alimony. </p> <p> These, however, can increase greatly in severity when dealing with the circumstances that surround military personnel. Military divorces are not simple – no matter when considering the people in question or whether you are dealing with the geographical location, it can be complex to try and wade through all of the nuances that surround these divorce cases in particular. </p> <p> As a military spouse for 24 years, Tonya has a deep understanding of the issues that may and will arise with dealing with military family law issues. Tonya understands the complex issues pertaining to relocation, visitation during deployments, and family care packages. Tonya strongly believes in zealous advocacy for those who wear the uniform, spouses and children that support them. </p>"
    },
    {
      "shortName": "Modification of Prior Orders",
      "title": "Modification of Prior Orders",
      "link": "/practice-areas/modification-of-prior-orders/",
      "image": "/assets/images/practice-areas/modification.jpg",
      "description": "Your legal expert",
      "icon": "icofont-law-document",
      "text": "<p>When an order for child custody, child support, or spousal support is first created, the goal is to set up an arrangement that meets the needs of those involved and that will work for everyone. However, no custody or support order can predict the future. Lives change frequently as jobs are found or lost, people move across town or across the country, and other events unexpectedly alter lives. </p> <p> If there has been a substantial change in circumstances, Courts may modify prior orders. If you need a modification in a custody or support order, contact Tonya Holman at 850-609-3100. </p>"

    },
    {
      "shortName": "Parental Relocation",
      "title": "Parental Relocation",
      "link": "/practice-areas/parental-relocation/",
      "image": "/assets/images/practice-areas/parentalrelocation.jpg",
      "description": "Managing your transition",
      "icon": "icofont-lawyer-alt-1",
      "text": "<p> A parent may be prohibited from relocating a child’s residence more than 50 miles from their current residence if certain conditions apply. Parents who wish to relocate outside of the permissible radius (50 miles) and who do not have the written consent of the other parent, must file a petition for relocation and comply with the statutory requirements prior to obtaining a court order allowing said relocation. </p> <p> For additional information about parental relocation of children in the aftermath of divorce, or if you need specific advice about a proposed move, contact Tonya Holman, your family law attorney </p>"
    },
    {
      "shortName": "Probate",
      "title": "Probate",
      "link": "/practice-areas/probate/",
      "image": "/assets/images/practice-areas/probate.jpg",
      "description": "Representing your interests",
      "icon": "icofont-money",
      "text": "<p> Probate is the legal process by which a person’s assets are distributed after death. If a person dies with a valid will, the estate is considered testate, and a personal representative (executor) is named to attend to the resolution of the estate. If a person dies without a will (intestate), the Court will appoint a personal representative in accordance with the statute. Regardless of whether or not a will is involved, the assets of the deceased must be determined and any debts against them settled. This can be a complicated process when there is a paucity of records and information left by the decedent or when there are competing claims on the part of creditors. Tonya Holman will represent an estate’s executor, as well as family members interested in contesting a will. We understand the financial and legal issues involved and can often save clients time and money in settling an estate through probate. </p> <h2>Estate Planning and Probate Administration</h2> <p> Our firm can advise the personal representative and provide probate services throughout all steps of the probate process, including: </p> <ul class=\"arrow\"> <li>Filing a petition to name a personal representative</li> <li>Marshalling and valuing the assets and debts of the estate</li> <li> Notifying creditors and other interested parties of the probate action </li> <li> Counseling personal representatives on the actions they must take to fulfill their fiduciary duty </li> <li>Payment of outstanding debts and tax obligations</li> <li> Distribution of the remaining estate assets according to the wishes of the decedent </li> <li>Applying for federal tax ID number for an estate or trust</li> <li> Wrapping up the estate and filing all necessary papers with the Court </li> </ul>"
    },
    {
      "shortName": "Wills and Trusts",
      "title": "Wills and Trusts",
      "link": "/practice-areas/wills-and-trusts/",
      "image": "/assets/images/practice-areas/wills.jpg",
      "description": "Designing your future",
      "icon": "icofont-papers",
      "text": "<p> In Florida, if you die without a will, your property will be distributed according to state “intestacy” laws. Florida’s intestacy law gives your property to your closest relatives, beginning with your spouse and children. If you have neither a spouse nor children, your grandchildren or your parents will get your property. This list continues with increasingly distant relatives, including siblings, grandparents, aunts and uncles, cousins, and your spouse’s relatives. If the court exhausts this list to find that you have no living relatives by blood or marriage, the state will take your property. </p> <p> A will, also called a “last will and testament,” can help you protect your family and your property. You can use a will to: </p> <ul class=\"arrow\"> <li>leave your property to people or organizations</li> <li>name a personal guardian to care for your minor children</li> <li> name a trusted person to manage property you leave to minor children </li> <li> name a personal representative, the person who makes sure that the terms of your will are carried out. </li> </ul>"
    }
]